{"ctrl_q":"ctrl_q Control q Quits Viper asking to save any unsaved buffers\n","fn_3":"fn_3 F3 asks for key and speaks its action\n","fn_2":"fn_2 F2 speaks the name of the current buffer with possible star if it is modifie\n","fn_1":"fn_1 F1 speaks the status of the editor with number of buffers open\n","fn_4":"fn_4 F4 Sets the default mark underline at the current character position\n","meta_semicolon":"meta_semicolon Enters command returns after commands have been entered and executed\n","ctrl_s":"ctrl_s Control s saves the current buffer\n","ctrl_c":"ctrl_c Control c copies the current marked selection\n","ctrl_v":"ctrl_v Control v Pastes the contents of the current clipboard to the current position of the current buffer\n","ctrl_x":"ctrl_x Control x Cuts the contents of the current selection to the clipboard\n","ctrl_f":"ctrl_f Control f Enters search mode. Will search forward after search string is entered\n","ctrl_r":"ctrl_r Control r Enters search mode. Will search backward for entered search string.\n","ctrl_g":"ctrl_g Control g Searches again in the last search direction\n","ctrl_t":"ctrl_t Control t Switches to the next buffer\n","ctrl_a":"ctrl_a Control a Selects the entire buffer\n","ctrl_o":"ctrl_o Control o Opens a new line below the current line\n","ctrl_j":"ctrl_j Control j Speaks the character under the cursor\n","ctrl_k":"ctrl_k Control k speaks the currrent position on the line\n","ctrl_l":"ctrl_l Control l speaks the entire current line\n","ctrl_n":"ctrl_n Control n Opens new scratch buffer","ctrl_z":"ctrl_z Control z Undo the last action","ctrl_y":"ctrl_y Control y Yanks the current line to the clipboard","ctrl_u":"ctrl_u Control u Redoes the last action which was undon with Control z","ctrl_w":"ctrl_w Control w Moves forward one word","meta_w":"meta_w Meta w Moves backward one word","meta_j":"meta_j Meta j Speaks the current word forward","meta_k":"meta_k Meta k Speaks the offset or indent level of the current line","meta_l":"meta_l Meta l Speaks the current line number of the current line","meta_m":"meta_m Meta m Sets mark named the next key pressed","meta_comma":"meta_comma Meta comma Invokes the macro named for the word backward","move_left":"move_left Left arrow moves one character to the left or beginning of the buffer","move_right":"move_right Right arrow Moves one character to the right or end of the buffer","move_up":"move_up Up arrow Moves up one line","move_down":"move_down Down Arrow Moves one line down","move_shift_pgdn":"move_shift_pgdn Shift Page Down Moves to the end of the buffer","move_shift_pgup":"move_shift_pgup Shift Page Up Moves to the beginning of the buffer","move_shift_home":"move_shift_home Shift Home Moves to the beginning of the line","move_shift_end":"move_shift_end Shift End Moves to the end of the line","meta_a":"meta_a Meta a Pages down 10 lines speaking each line","meta_f":"meta_f Moves to the next tab point","meta_r":"meta_r Moves to the previous tab point","fn_6":"fn_6 Starts macro recording. Press F6 again to stop recording.","meta_number":"meta_number Comment the current line","meta_less":"meta_less Outdents current line","meta_greater":"meta_greater Indents current line","tab":"tab Inserts  spaces","back_tab":"back_tab Deletes  characters outdent","ctrl_m":"ctrl_m Inserts newline at current position","key_backspace":"key_backspace Deletes one character in buffer","key_delete":"key_delete Deletes one character forward in buffer","ctrl_i":"ctrl_i Inserts  spaces","key_backtab":"key_backtab Deletes  spaces","move_shift_left":"move_shift_left Highlights or de highlights one character to the left","move_shift_right":"move_shift_right Highlights one character to the right","meta_h":"meta_h Alt h : Launches help browser","fn_5":"fn_5 sets special mark t for use in macro recording","meta_1":"fn_1 F1 speaks the status of the editor with number of buffers open\n","meta_2":"fn_2 F2 speaks the name of the current buffer with possible star if it is modifie\n","meta_3":"fn_3 F3 asks for key and speaks its action\n","meta_4":"fn_4 F4 Sets the default mark underline at the current character position\n","meta_5":"fn_5 sets special mark t for use in macro recording","meta_6":"fn_6 Starts macro recording. Press F6 again to stop recording.","meta_n":"meta_n Inserts a key at the current cursor position.","meta_z":"meta_z Redoes the last undone action."}